# DBMS - Database Management System

In [ ]:
DBMS contains two types of data

Relational database - which holds data  in rows and columns
Oracle, MySQL server, SQL lite, MY SQL

Non Relational database - which does not hold in rows and columns
No SQL, JPG, video, audio, text etc 

# Anaconda has built in SQL lite software

In [ ]:
SQL - Structured Query Language contains 3 types

DDL - Data Definition language - create,after,drop
DML - Data Manipulation language - select,insert,update,delete
DCL - Data Control Language  - cancel, grant,revoke - Data administrator controls this part to provide access.

# Working with database using SQL(Structured Query Language)

1. Create a connection object
2. From the connection object, create a cursor object
3. Using the cursor object, call the execute with create table query as the parameter

# Create Database

In [ ]:
# student database will be created in jupyter notebook home

# first connection object

db = sqlite3.connect("student.database.db")

Cursor

A cursor in SQL is temporary work area created in system memory when a SQL statement is executed.
A SQL cursor is a set of rows together with a pointer that identifies a current row.
It is a database object to retrieve data from a result set one row at a time.

In [ ]:
# create cursor object from connection

cur = db.cursor()

In [1]:
import sqlite3

In [2]:
db = sqlite3.connect('student_detail_database.db')

In [3]:
cur = db.cursor()

In [ ]:
cur.execute('create table student(id int primary key, name text, marks int)') # cur.execute helps us to interact with SQL
                                                                              # and is used only in jupyter

In [5]:
cur.execute("insert into student(id,name,marks) values(101,'Naveen',80)") # use double quotation

In [6]:
db.commit()

In [7]:
cur.execute("insert into student(id,name,marks) values(102,'Ranga',99)")
db.commit()

In [8]:
cur.execute("insert into student(id,name,marks) values(103,'Theinamma',100)")
db.commit()

In [9]:
results = cur.execute("select * from student")  # * is used for multiple selection

for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)

In [12]:
cur.execute("insert into student(id,name,marks) values(104,'Deepan',85)")
db.commit()

In [13]:
cur.execute("insert into student values(105,'Rupavathi',75),(106,'Krithvik',70)")
db.commit()

In [14]:
results = cur.execute("select * from student")  # * wild card character is used to show all columns

for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)

In [15]:
results = cur.execute("select * from student")
results.fetchall()            # fetchall will be used if we have more than 1 result, simmilar to for i statement

[(101, 'Naveen', 80),
 (102, 'Ranga', 99),
 (103, 'Theinamma', 100),
 (104, 'Deepan', 85),
 (105, 'Rupavathi', 75),
 (106, 'Krithvik', 70)]

In [16]:
results = cur.execute("select id from student")
results.fetchall()

[(101,), (102,), (103,), (104,), (105,), (106,)]

In [17]:
results = cur.execute("select id from student")
for i in results:
    print(i)

(101,)
(102,)
(103,)
(104,)
(105,)
(106,)

In [19]:
results = cur.execute("select name,marks from student")
results.fetchall()

[('Naveen', 80),
 ('Ranga', 99),
 ('Theinamma', 100),
 ('Deepan', 85),
 ('Rupavathi', 75),
 ('Krithvik', 70)]

In [21]:
results = cur.execute("select * from student where id = 102")
results.fetchall()

[(102, 'Ranga', 99)]

In [22]:
results = cur.execute("select * from student where id = 103")
results.fetchone()      # fetchone to get result for specified selection

(103, 'Theinamma', 100)

In [23]:
results = cur.execute("select * from student where name = 'Ranga'")
for i in results:
    print(i)

(102, 'Ranga', 99)

In [26]:
results = cur.execute("select * from student where name in ('Ranga','Theinamma')")
for i in results:
    print(i)

(102, 'Ranga', 99)
(103, 'Theinamma', 100)

In [27]:
results = cur.execute("select * from student where Id in (101,102,103,104)")
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)

In [33]:
results = cur.execute("select * from student order by name desc") # Getting results by descending order using # order by 
for i in results:
    print(i)

(103, 'Theinamma', 100)
(105, 'Rupavathi', 75)
(102, 'Ranga', 99)
(101, 'Naveen', 80)
(106, 'Krithvik', 70)
(104, 'Deepan', 85)

In [34]:
results = cur.execute("select * from student order by name asc") # Getting results by ascending order using # order by
for i in results:
    print(i)

(104, 'Deepan', 85)
(106, 'Krithvik', 70)
(101, 'Naveen', 80)
(102, 'Ranga', 99)
(105, 'Rupavathi', 75)
(103, 'Theinamma', 100)

In [35]:
results = cur.execute("select * from student")
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)

# We can work on the same data by importing SQLite and connecting to 

db = sqlite3.connect('student_detail_database.db')

cur = db.cursor()

In [36]:
cur.execute("insert into student values(107,'Mari',75),(108,'Subha',80)")
db.commit()

In [38]:
results = cur.execute("select * from student where marks = 80")
for i in results:
    print(i)

(101, 'Naveen', 80)
(108, 'Subha', 80)

In [39]:
results = cur.execute("select * from student")
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)
(107, 'Mari', 75)
(108, 'Subha', 80)

In [40]:
results = cur.execute("select * from student where id in (102,103,104)")
for i in results:
    print(i)

(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)

In [41]:
results = cur.execute("select * from student limit 6") # Using limit to extract the result by limiting it to the given input
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)

In [42]:
results = cur.execute("select * from student order by marks desc") 
for i in results:
    print(i)

(103, 'Theinamma', 100)
(102, 'Ranga', 99)
(104, 'Deepan', 85)
(101, 'Naveen', 80)
(108, 'Subha', 80)
(105, 'Rupavathi', 75)
(107, 'Mari', 75)
(106, 'Krithvik', 70)

In [43]:
results = cur.execute("select * from student order by marks asc") 
for i in results:
    print(i)

(106, 'Krithvik', 70)
(105, 'Rupavathi', 75)
(107, 'Mari', 75)
(101, 'Naveen', 80)
(108, 'Subha', 80)
(104, 'Deepan', 85)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)

In [46]:
results = cur.execute("select * from student order by marks asc limit  3 ") 
for i in results:
    print(i)

(106, 'Krithvik', 70)
(105, 'Rupavathi', 75)
(107, 'Mari', 75)

In [47]:
results = cur.execute("select * from student order by marks desc limit  3 ") 
for i in results:
    print(i)

(103, 'Theinamma', 100)
(102, 'Ranga', 99)
(104, 'Deepan', 85)

In [48]:
results = cur.execute("select marks from student where name is 'Naveen' ") 
for i in results:
    print(i)

(80,)

In [49]:
results = cur.execute("select marks from student where name is 'Ranga' ") 
for i in results:
    print(i)

(99,)

In [52]:
results = cur.execute("select * from student where marks >80 and marks <99 ") 
for i in results:
    print(i)

(104, 'Deepan', 85)

In [53]:
results = cur.execute("select * from student where marks >70 and marks <99 ") 
for i in results:
    print(i)

(101, 'Naveen', 80)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(107, 'Mari', 75)
(108, 'Subha', 80)

In [58]:
results = cur.execute("select * from student where name = 'Naveen' and marks = 99 ") 
for i in results:
    print(i)        # No result when using and operator as both the statement should be True

In [61]:
results = cur.execute("select * from student where name = 'Naveen' or marks > 90 ") 
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)

Aggregate functions

MIN -- find minimum
MAX -- find maximum
AVG -- find average
SUM -- find sum
COUNT -- coiunt the number of rows

In [62]:
# find minimum marks 

results = cur.execute("select min(marks) from student") 
for i in results:
    print(i)

(70,)

In [64]:
# find maximum marks 

results = cur.execute("select max(marks) from student") 
results.fetchall()

[(100,)]

In [66]:
results = cur.execute("select * from student where marks is null")  # null operator
results.fetchall()

[]

In [68]:
results = cur.execute("select * from student where marks is not null") 
results.fetchall()

[(101, 'Naveen', 80),
 (102, 'Ranga', 99),
 (103, 'Theinamma', 100),
 (104, 'Deepan', 85),
 (105, 'Rupavathi', 75),
 (106, 'Krithvik', 70),
 (107, 'Mari', 75),
 (108, 'Subha', 80)]

In [72]:
results = cur.execute("select * from student where name like 'R%'")  # like operator starting name from letter
results.fetchall()

[(102, 'Ranga', 99), (105, 'Rupavathi', 75)]

In [73]:
results = cur.execute("select * from student where name like 'N%'")  # like operator starting name from letter
for i in results:
    print(i)

(101, 'Naveen', 80)

In [75]:
results = cur.execute("select * from student where name like 'T%'")  # like operator starting name from letter
for i in results:
    print(i)

(103, 'Theinamma', 100)

In [78]:
results = cur.execute("select * from student where name like '_a%'")  
for i in results:                   # like operator starting name from letter, underscore denotes char place '_a' means second letter                                    
    print(i)                        # '__a' third letter with two underscore

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(107, 'Mari', 75)

In [81]:
results = cur.execute("select * from student where name like '%a'")  # like operator ending name from letter 'a'
for i in results:
    print(i)

(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(108, 'Subha', 80)

In [82]:
results = cur.execute("select * from student where name like '%n'")  # like operator ending name from letter 'a'
for i in results:
    print(i)

(101, 'Naveen', 80)
(104, 'Deepan', 85)

In [83]:
results = cur.execute("select * from student where name like '%n%'")  # like operator contains name with letter 'n'
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)

In [84]:
results = cur.execute("select * from student where name like '%a%'")  # like operator contains name with letter 'n'
for i in results:
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(107, 'Mari', 75)
(108, 'Subha', 80)

In [85]:
results = cur.execute("select * from student where name like '%i%'")  # like operator contains name with letter 'n'
for i in results:
    print(i)

(103, 'Theinamma', 100)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)
(107, 'Mari', 75)

In [86]:
# update record

sql = "update student set marks = 81 where id is 107"
cur.execute(sql)

In [88]:
results = cur.execute("select * from student")  
for i in results:  # mari 107 updated marks with 81
    print(i)

(101, 'Naveen', 80)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)
(107, 'Mari', 81)
(108, 'Subha', 80)

In [91]:
sql = "update student set marks = 88 where id in (101,108)"
cur.execute(sql)

In [92]:
results = cur.execute("select * from student")  
for i in results:  # mari 107 updated marks with 81
    print(i)

(101, 'Naveen', 88)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)
(107, 'Mari', 88)
(108, 'Subha', 88)

# Delete any unwanted records

In [93]:
sql = "delete from student where id = 107"
cur.execute(sql)

In [94]:
results = cur.execute("select * from student")  
for i in results:  
    print(i)

(101, 'Naveen', 88)
(102, 'Ranga', 99)
(103, 'Theinamma', 100)
(104, 'Deepan', 85)
(105, 'Rupavathi', 75)
(106, 'Krithvik', 70)
(108, 'Subha', 88)

# Drop table student

In [95]:
sql = "drop table student"
cur.execute(sql)  # dropping the table

In [96]:
results = cur.execute("select * from student")  
for i in results:  # mari 107 updated marks with 81
    print(i)

OperationalError: no such table: student

In [97]:
db.close()

# delete will delete the rows one by one
# truncate the table will truncate all the data at once means will delete 
# drop will drop or remove the entire table

# Creating Database inside C or E drive

In [98]:
import sqlite3

In [102]:
db = sqlite3.connect("C://Users//navee//Desktop//Data Science Course Materials//082022 and 082122 Serialization,Exception handling//Employee.db")

In [120]:
cur = db.cursor()

In [106]:
cur.execute('create table employee(empid int primary key, empname text, sal float)')

In [109]:
cur.execute('insert into employee(empid,empname,sal) values(001,"Ranga",500000.50)')

In [111]:
db.commit()

In [123]:
results = cur.execute("select * from employee") 
for i in results:
    print(i)

(1, 'Ranga', 500000.5)

In [124]:
print(cur.rowcount,'employee')

-1 employee

# Inserting records from csv file

In [126]:
with open('emp.csv','r') as file:
    total_records = 0
    for row in file:
        cur.execute("insert into employee values(?,?,?)",row.split(","))
        db.commit()
        total_records +=1
print(total_records,'Records Inserted')

11 Records Inserted

In [127]:
results = cur.execute("select * from employee")
results.fetchall()

[(1, 'Ranga', 500000.5),
 (2, "'Theinamma'", 450000.32),
 (3, "'Naveen'", 250000.5),
 (4, "'Deepan'", 350000.5),
 (5, "'Rupavathi'", 300000.32),
 (6, "'Krithvik'", 200000.5),
 (7, "'Mari'", 250000.5),
 (8, "'Subha'", 250000.5),
 (9, "'Bruce'", 200000.32),
 (10, "'Clark'", 200000.33),
 (11, "'Diana'", 200000.22),
 (12, "'Barry'", 205000.5)]

# Constraints

# primary key - must be unique and no null value
# unique key  - Enter only unique values, no duplicate values.....blank is possible
not null      - no blank values can be inserted in table

In [128]:
db = sqlite3.connect("C:/Users/navee/Desktop/Data Science Course Materials/082722 and 082822/SQL database/sports.db")

In [129]:
cur1 = db.cursor()

In [130]:
cur.execute('create table sports(id int primary key, sportname text unique,dateofevent date,country not null)')

In [142]:
cur.execute('insert into sports values(1,"Cricket","2022-02-22","India")')

In [136]:
cur.execute('insert into sports values(2,"Football","2022-02-23","Brazil")')

In [137]:
db.commit()

In [138]:
results = cur.execute("select * from sports")
results.fetchall()

[(1, 'Cricket', 1998, 'India'), (2, 'Football', '2022-02-23', 'Brazil')]

In [139]:
sp = "delete from sports where id = 1"
cur.execute(sp)    # Used to delete line 1 as the  date format ws incorrectly added into the table

In [143]:
results = cur.execute("select * from sports")
results.fetchall()

[(2, 'Football', '2022-02-23', 'Brazil'),
 (1, 'Cricket', '2022-02-22', 'India')]

In [ ]:
# cur.execute('insert into sports values(2,"Cricket","2022-02-24","Argentina")')

# IntegrityError: UNIQUE constraint failed: sports.sportname

# As Cricket is already existing, we are getting Unique constraint error

In [146]:
cur.execute('insert into sports values(3,"Rugby","2022-02-24","Argentina")')

In [ ]:
# cur.execute('insert into sports values(4,"Basketball","2022-02-24","NULL")')

# IntegrityError: UNIQUE constraint failed: sports.sportname

# As Country name we have given Null Constraint, we are getting Unique constraint error, it should  not be in NULL value

In [151]:
results = cur.execute("select * from sports")
results.fetchall()

[(2, 'Football', '2022-02-23', 'Brazil'),
 (1, 'Cricket', '2022-02-22', 'India'),
 (3, 'Rugby', '2022-02-24', 'Argentina'),
 (4, 'Basketball', '2022-02-24', 'Null')]

In [152]:
sp = "delete from sports where id = 4"
cur.execute(sp)

In [153]:
cur.execute('insert into sports values(4,"Basketball","2022-02-24","USA")')

In [154]:
results = cur.execute("select * from sports")
results.fetchall()

[(2, 'Football', '2022-02-23', 'Brazil'),
 (1, 'Cricket', '2022-02-22', 'India'),
 (3, 'Rugby', '2022-02-24', 'Argentina'),
 (4, 'Basketball', '2022-02-24', 'USA')]

In [155]:
results = cur.execute("select * from sports order by id asc") 
for i in results:
    print(i)

(1, 'Cricket', '2022-02-22', 'India')
(2, 'Football', '2022-02-23', 'Brazil')
(3, 'Rugby', '2022-02-24', 'Argentina')
(4, 'Basketball', '2022-02-24', 'USA')

# Employee database with DB and Python programmatically

In [175]:
con1 = sqlite3.connect("C:/Users/navee/Desktop/Data Science Course Materials/082722 and 082822/SQL database/employees.db")

In [176]:
def sql_table(con1):
    cur = con1.cursor()
    cur.execute("Create table employees(id int primary key,name text,salary real,department text,position text,hire date)")
    con1.commit()

In [177]:
# calling function

sql_table(con1)

In [179]:
cur = con1.cursor()
cur.execute("insert into employees values(1,'Jack',10000,'HR','Lead','2022-01-02')")

In [180]:
con1.commit()

In [181]:
results = cur.execute("select * from employees")
results.fetchall()

[(1, 'Jack', 10000.0, 'HR', 'Lead', '2022-01-02')]

We can also pass values\arguments to an INSERT statement in the execute() method. we can use the question mark (?) as a
placeholder for each value. The syntax of the INSERT will be like the following:
    
cur.execute("insert into employees(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)",entities)

entities = (2,'John',4000,'IT','Engineer','2018-07-25')

In [189]:
def sql_insert(con1,entities):
    cur = con1.cursor()
    cur.execute("insert into employees(id,name,salary,department,position,hire) values(?,?,?,?,?,?)",entities)

In [190]:
entities = (2,'Andrew',7000,'IT','Engineer','2015-08-22')

In [191]:
# calling sql insert to insert the data

sql_insert(con1,entities)

In [192]:
results = cur.execute("select * from employees")
results.fetchall()

[(1, 'Jack', 10000.0, 'HR', 'Lead', '2022-01-02'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-08-22')]

In [199]:
entities = (3,'Mathew',7500,'IT','Tester','2015-08-25')
sql_insert(con1,entities)

In [200]:
entities = (4,'Carol',9000,'HR','Lead','2022-12-30')
sql_insert(con1,entities)

In [195]:
entities = (5,'Aryan',15000,'Operations','Manager','2022-12-24')

In [196]:
# calling sql insert to insert the data

sql_insert(con1,entities)

In [197]:
con1.commit()

In [201]:
results = cur.execute("select * from employees")
results.fetchall()

[(1, 'Jack', 10000.0, 'HR', 'Lead', '2022-01-02'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-08-22'),
 (5, 'Aryan', 15000.0, 'Operations', 'Manager', '2022-12-24'),
 (3, 'Mathew', 7500.0, 'IT', 'Tester', '2015-08-25'),
 (4, 'Carol', 9000.0, 'HR', 'Lead', '2022-12-30')]

In [203]:
results = cur.execute("select * from employees order by id asc")
results.fetchall()

[(1, 'Jack', 10000.0, 'HR', 'Lead', '2022-01-02'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-08-22'),
 (3, 'Mathew', 7500.0, 'IT', 'Tester', '2015-08-25'),
 (4, 'Carol', 9000.0, 'HR', 'Lead', '2022-12-30'),
 (5, 'Aryan', 15000.0, 'Operations', 'Manager', '2022-12-24')]

In [204]:
results = cur.execute("select min(salary) from employees")  # fetching results using min
results.fetchall()

[(7000.0,)]

In [205]:
results = cur.execute("select count(id) from employees") # fetching results using count
results.fetchall()

[(5,)]

In [206]:
results = cur.execute("select distinct(department) from employees") # fetching results using distinct(unique)
results.fetchall()

[('HR',), ('IT',), ('Operations',)]

In [208]:
results = cur.execute("select count(distinct(department)) from employees") # fetching results using count and distinct(unique)
results.fetchall()

[(3,)]

In [209]:
results = cur.execute("select sum(salary),department from employees group by department") 
results.fetchall()                                                  # fetching results using group by

[(19000.0, 'HR'), (14500.0, 'IT'), (15000.0, 'Operations')]

In [211]:
results = cur.execute("select sum(salary),position from employees group by position") # fetching results using group by
results.fetchall()

[(7000.0, 'Engineer'),
 (19000.0, 'Lead'),
 (15000.0, 'Manager'),
 (7500.0, 'Tester')]

In [212]:
def sql_query(sql):
    cur = con1.cursor()
    results = cur.execute(sql)
    return results

In [215]:
# make query

sql = "select * from employees order by id asc"

# pass query in function

respond = sql_query(sql)
respond.fetchall()

[(1, 'Jack', 10000.0, 'HR', 'Lead', '2022-01-02'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-08-22'),
 (3, 'Mathew', 7500.0, 'IT', 'Tester', '2015-08-25'),
 (4, 'Carol', 9000.0, 'HR', 'Lead', '2022-12-30'),
 (5, 'Aryan', 15000.0, 'Operations', 'Manager', '2022-12-24')]